Repository: MaximeCulea/meetup-git
Catalog: content/plugins/bbq-pro/languages/bbq-pro-*.po
Languages: fr_fr

source: should not be run with the free version of BBQ (there is no need for both plugins).
fr_fr: ne devrait pas être exécuté avec la version gratuite de BBQ (il n'y a pas besoin de deux plugins).

source: Please return to the
fr_fr: Merci de retourner dans

source: WP Admin Area
fr_fr: Zone d'administration

source: to deactivate the free version and try again.
fr_fr: pour désactiver la version gratuite et essayez à nouveau.

source: requires WordPress
fr_fr: nécessite WordPress

source: or higher, and has been deactivated.
fr_fr: ou plus, et a été désactivé.

source: to upgrade WordPress and try again.
fr_fr: pour mettre à jour WordPress et réessayer.

source: Cheatin&rsquo; huh?
fr_fr: Vous trichez&rsquo; euh?

source: Error: Invalid IP Address
fr_fr: Erreur: Adresse IP invalide

source: BBQ Pro: Invalid IP Address:
fr_fr: BBQ Pro: Adresse IP invalide:

source: More Information
fr_fr: Détails de l'offre

source: Visit the
fr_fr: Consultez l'onglet

source: BBQ Docs
fr_fr: Documentation BBQ

source: at Plugin Planet.
fr_fr: chez Plugin Planet.

source: Report an issue in the
fr_fr: Signaler un problème dans le

source: BBQ Support Forum
fr_fr: Forum de Support BBQ

source: Contact the plugin developer
fr_fr: Contactez le développeur du plugin

source: for help.
fr_fr: demandez de l’aide.

source: Make a donation&nbsp;&raquo;
fr_fr: Faire un don&nbsp;&raquo;

source: Welcome to BBQ Pro
fr_fr: Bienvenue chez BBQ Pro

source: BBQ Pro is a lightweight and flexible firewall that protects your site from bad HTTP requests.
fr_fr: BBQ Pro est un pare-feu léger et flexible qui protège votre site contre de mauvaises demandes HTTP.

source: You can customize BBQ Pro via
fr_fr: Vous pouvez personnaliser BBQ Pro via

source: BBQ Settings
fr_fr: Paramètres BBQ

source: and you can fine-tune blocked requests via
fr_fr: et vous pouvez affiner les requêtes bloquées via

source: BBQ Patterns
fr_fr: Les modèles BBQ

source: Useful BBQ Resources
fr_fr: Ressources utiles BBQ

source: View the plugin&rsquo;s readme.txt
fr_fr: Découvre le Plugin&rsquo;s readme.txt

source: Log in to your account at Plugin Planet
fr_fr: Connectez-vous à votre compte Plugin Planet

source: Get help in the Support Forum
fr_fr: Obtenez de l'aide dans le forum d'assistance

source: Contact the plugin developer for help
fr_fr: Contactez le développeur du plugin pour obtenir de l'aide

source: About the Developer
fr_fr: A propos du développeur

source: BBQ Pro is developed by
fr_fr: BBQ Pro est développé par

source: 10-year WordPress veteran and
fr_fr: Ancien combattant WordPress de 10 ans et

source: book author
fr_fr: auteur du livre

source: Enable/Disable
fr_fr: Activer/désactiver

source: Enable/Disable Indicator
fr_fr: Indicateur d'activation / désactivation

source: When BBQ is active, the text &ldquo;BBQ is Enabled&rdquo; is displayed in green. When disabled, the text &ldquo;BBQ is Disabled&rdquo; is displayed in red.
fr_fr: Lorsque BBQ est actif, le texte &ldquo;BBQ est activé&rdquo; s'affiche en vert. Lorsqu'il est désactivé, le texte &ldquo;BBQ is Disabled" est affiché en rouge.

source: Each set of rules (Basic, Advanced, and Custom) consists of numerous individual patterns. Each of these patterns may be enabled or disabled via the &ldquo;Patterns&rdquo; screen.
fr_fr: Chaque ensemble de règles (Basic, Avancée et Personnalisé) se compose de nombreux modèles individuels. Chacun de ces motifs peut être activé ou désactivé via l'écran &ldquo;Patterns&rdquo;.

source: At least one pattern must be active in order for the Enable/Disable Indicator to display as &ldquo;Enabled&rdquo;.
fr_fr: Au moins un motif doit être actif afin que l'indicateur d'activation / désactivation s'affiche comme &ldquo;Activé&rdquo;.

source: So for example, let&rsquo;s say that only the Basic Rules are enabled for your site (i.e., the Advanced and Custom Rules are disabled).
fr_fr: Donc, par exemple, disons que seules les règles de base sont activées pour votre site (c'est-à-dire que les règles avancées et personnalisées sont désactivées).

source: That is perfectly fine, but now let&rsquo;s say that all of the patterns for the Basic Rules are disabled (i.e., unchecked boxes for all patterns).
fr_fr: C'est parfaitement bien, mais maintenant, disons que tous les modèles des règles de base sont désactivés (c.-à-d., Boîtes non cochées pour tous les motifs).

source: If this were the case, the Enable/Disable Indicator would display as disabled (red). Then if we enable any basic-rule pattern(s), the Indicator would display as enabled (green).
fr_fr: Si tel était le cas, l'indicateur d'activation / désactivation s'affiche comme désactivé (rouge). Ensuite, si nous activons n'importe quel modèle de règle de base, l'indicateur s'affiche comme activé (vert).

source: Default: enabled
fr_fr: Valeur par défaut: activée

source: Basic Rules
fr_fr: Règles de base

source: This setting enables BBQ&rsquo;s basic security rules. The Basic Rules are virtually identical to those provided in the
fr_fr: Ce paramètre permet les règles de sécurité de base de BBQ&rsquo;s Les règles de base sont pratiquement identiques à celles prévues dans le

source: free version of BBQ
fr_fr: version gratuite de BBQ

source: They are well-tested with WordPress and will protect your site against some of the most common types of malicious attacks and exploits.
fr_fr: Ils sont bien testés avec WordPress et protégeront votre site contre certains types les plus courants d'attaques et d'exploits malveillants.

source: You can fine-tune the Basic Rules by visiting the &ldquo;Basic&rdquo; tab on the
fr_fr: Vous pouvez affiner les règles de base en visitant l'onglet &ldquo;Basic&rdquo; sur le

source: Patterns
fr_fr: Les modèles

source: screen.
fr_fr: écran.

source: Advanced Rules
fr_fr: Règles avancées

source: This setting enables BBQ&rsquo;s Advanced Rules. This includes further protection against a variety of malicious attacks.
fr_fr: Ce paramètre permet les règles avancées de BBQ&rsquo;s. Ceci inclut une protection supplémentaire contre une variété d'attaques malveillantes.

source: The Advanced Rules primarily are derived from the
fr_fr: Les règles avancées dérivent principalement de

source: 5G Firewall
fr_fr: Pare-feu 5G

source: 6G Firewall
fr_fr: Pare-feu 6G

source: and other
fr_fr: et autres

source: security techniques
fr_fr: techniques de Sécurité

source: The Advanced Rules are disabled by default because they are not as widely tested as BBQ&rsquo;s Basic Rules.
fr_fr: Les règles avancées sont désactivées par défaut car elles ne sont pas aussi largement testées que les règles de base de BBQ&rsquo;s.

source: If you enable the Advanced Rules, it is recommended that you test your pages thoroughly.
fr_fr: Si vous activez les règles avancées, il est recommandé de bien tester vos pages.

source: If you discover any issue, you can fine-tune specific patterns by visiting the &ldquo;Advanced&rdquo; tab on the
fr_fr: Si vous découvrez tout problème, vous pouvez affiner les profils spécifiques en visitant l'onglet &ldquo;Avancé&rdquo; sur le

source: screen,
fr_fr: écran,

source: or you can disable the Advanced Rules altogether via this setting.
fr_fr: ou vous pouvez désactiver complètement les Règles avancées via ce paramètre.

source: Default: disabled
fr_fr: Désactivé par défaut

source: Custom Rules
fr_fr: Règles personnelles

source: This setting enables BBQ&rsquo;s Custom Rules. This enables you to add your own custom rules to BBQ.
fr_fr: Ce paramètre permet les règles personnalisées de BBQ&rsquo;s Cela vous permet d'ajouter vos propres règles personnalisées.

source: To do so, visit the &ldquo;Custom&rdquo; tab on the
fr_fr: Pour ce faire, visitez l'onglet &ldquo;Personnalisé&rdquo; sur le

source: screen.
fr_fr: écran.

source: If you enable any Custom Rules, it is recommended that you test your pages thoroughly.
fr_fr: Si vous activez toutes les règles personnalisées, il est recommandé de tester vos pages.

source: Logged-in Users
fr_fr: Utilisateurs connectés

source: This setting disables all BBQ protection for any URL requests that are made by logged-in users.
fr_fr: Ce paramètre désactive toutes les protections BBQ pour toutes les demandes d'URL effectuées par les utilisateurs connectés.

source: The assumption here is that users who have successfully logged in to your site will not be making malicious URL requests.
fr_fr: L'hypothèse ici est que les utilisateurs qui se sont connectés avec succès sur votre site ne feront pas de requêtes d'URL malveillantes.

source: While this may be true for individual admins and trusted teams, it may not be true for sites with many registered users.
fr_fr: Bien que cela puisse être vrai pour les administrateurs individuels et les équipes de confiance, il se peut que cela ne soit pas vrai pour les sites avec de nombreux utilisateurs enregistrés.

source: Limit Requests
fr_fr: Limiter les requêtes

source: Malicious URL requests often exceed 255 characters, however some services require long URLs in order to function.
fr_fr: Les demandes d'URL malveillantes dépassent souvent 255 caractères, mais certains services nécessitent des longues URL pour fonctionner.

source: Enable this setting to block requests that exceed 255 characters in length. Advisable if you are sure that your site does not use any long URLs.
fr_fr: Activez ce paramètre pour bloquer les requêtes qui dépassent 255 caractères. A conseillé si vous êtes sûr que votre site n'utilise pas de longues URL.

source: If you are unsure, leave this setting disabled.
fr_fr: Si vous n'êtes pas sûr, laissez ce paramètre désactivé.

source: Strict Mode
fr_fr: Mode strict

source: By default, BBQ Pro checks each request &ldquo;as-is&rdquo;, without decoding any encoded characters.
fr_fr: Par défaut, BBQ Pro vérifie chaque demande &ldquo;tel quel&rdquo;, sans décoder les caractères codés.

source: For example, if a request contains
fr_fr: Par exemple, si une requête contient

source: unencoded
fr_fr: non codé

source: square brackets
fr_fr: crochets

source: and
fr_fr: et

source: BBQ will block the request because unencoded square brackets are considered
fr_fr: BBQ va bloquer la demande car les crochets non codés sont considérés

source: unsafe
fr_fr: peu sûr

source: On the other hand, if the request contains
fr_fr: D'autre part, si la demande contient

source: encoded
fr_fr: codé

source: square brackets,
fr_fr: crochets,

source: BBQ will not block the request because encoded characters are considered safe.
fr_fr: BBQ ne bloquera pas la demande car les caractères codés sont considérés comme sûrs.

source: When enabled, Strict Mode instructs BBQ to block both unencoded and encoded variations of all active patterns. So in our example, requests containing square brackets will be blocked,
fr_fr: Lorsqu'il est activé, le mode Strict demande au BBQ de bloquer les variations non codées et encodées de tous les motifs actifs. Donc, dans notre exemple, les demandes contenant des crochets seront bloquées,

source: regardless of whether or not the brackets are encoded. Likewise for every active pattern, when Strict Mode is enabled, active patterns will be blocked even if they are encoded.
fr_fr: indépendamment du fait que les crochets soient ou non codés. De même pour chaque motif actif, lorsque le Mode Strict est activé, les motifs actifs seront bloqués même s'ils sont encodés.

source: If in doubt, leave Strict Mode disabled. Strict Mode exists for advanced users who want to customize their firewall for maximum protection.
fr_fr: En cas de doute, laissez Strict Mode désactivé. Le mode Strict existe pour les utilisateurs avancés qui souhaitent personnaliser leur pare-feu pour une protection maximale.

source: Redirect URL
fr_fr: URL de redirection

source: By default, when BBQ blocks a bad request, it exits and returns a &ldquo;403 Forbidden&rdquo; status code.
fr_fr: Par défaut, lorsque BBQ bloque une mauvaise demande, il sort et renvoie un code d'état &ldquo;403 Interdit&rdquo.

source: If you would rather redirect the bad request to a specific location, you may enter the URL here.
fr_fr: Si vous souhaitez plutôt rediriger la mauvaise demande vers un emplacement spécifique, vous pouvez entrer l'URL ici.

source: See also the setting, &ldquo;Status Code&rdquo; to choose an appropriate status code.
fr_fr: Voir aussi le paramètre &ldquo;Code d'état&rdquo; pour choisir un code d'état approprié.

source: When using this option to redirect blocked requests, a 301 (permanent redirect) or 302 (temporary/found) status code is required.
fr_fr: Lorsque vous utilisez cette option pour rediriger les demandes bloquées, un code d'état 301 (redirection permanente) ou 302 (temporaire / trouvé) est requis.

source: If a code other than 301 or 302 is specified, a 302 code will be used. Leave blank for no redirect.
fr_fr: Si un code autre que 301 ou 302 est spécifié, un code 302 sera utilisé. Laissez vide pour aucune redirection.

source: Default: blank (no redirect)
fr_fr: Par défaut: vide (pas de redirection)

source: Custom Message
fr_fr: Message personnalisé

source: If you would like to display a custom message, you may enter it here (you may use text and/or markup).
fr_fr: Si vous souhaitez afficher un message personnalisé, vous pouvez l'entrer ici (vous pouvez utiliser le texte et / ou le balisage).

source: You may use
fr_fr: Vous pouvez utiliser

source: to display the matching pattern.
fr_fr: pour afficher le modèle correspondant.

source: See also the setting, &ldquo;Status Code&rdquo; to choose an appropriate status code.
fr_fr: Voir aussi le paramètre &ldquo;Code d'état&rdquo; pour choisir un code d'état approprié.

source: Note:
fr_fr: Remarque :

source: If enabled, the setting &ldquo;Redirect URL&rdquo; overrides any custom message.
fr_fr: Si activé, le paramètre &ldquo;URL de redirection&rdquo; remplace tout message personnalisé.

source: Default: blank (no custom message)
fr_fr: Par défaut: vide (pas de message personnalisé)

source: Status Code
fr_fr: Code de Statut

source: This setting determines how BBQ responds to blocked requests.
fr_fr: Ce paramètre détermine comment BBQ répond aux demandes bloquées.

source: By default, BBQ responds to blocked requests with a &ldquo;403 &ndash; Forbidden&rdquo; status code, which is recommended.
fr_fr: Par défaut, BBQ répond aux demandes bloquées avec un code d'état &ldquo;403 &ndash; Prohibé&rdquo; ce qui est recommandé.

source: You are free to change the default 403 response to whatever makes sense for your site.
fr_fr: Vous êtes libre de modifier la réponse 403 par défaut.

source: If you are
fr_fr: Si vous n'êtes

source: redirecting
fr_fr: rediriger

source: blocked requests, you must use a 301 or 302 status code (see the setting &ldquo;Redirect URL&rdquo;).
fr_fr: demandes bloquées, vous devez utiliser un code d'état 301 ou 302 (voir le paramètre &ldquo;de Redirection d'URL&rdquo;).

source: It is important to understand that status codes may impact SEO. If in doubt, use the default setting (recommended).
fr_fr: Il est important de comprendre que les codes d'état peuvent avoir un impact sur le référencement. En cas de doute, utilisez le paramètre par défaut (recommandé).

source: Learn more about HTTP status codes
fr_fr: En savoir plus sur les codes d'état HTTP

source: Default: 403 Forbidden
fr_fr: Par défaut: 403 Interdit

source: Remove Disabled
fr_fr: Supprimer désactivé

source: Enable this setting to remove any disabled (unselected)
fr_fr: Activez ce paramètre pour supprimer et tout désactivé (non sélectionné)

source: After enabling this setting, visit the BBQ Patterns and click the &ldquo;Save Changes&rdquo; button for each section (Basic, Advanced, and Custom).
fr_fr: Après avoir activé ce paramètre, visitez les modèles BBQ et cliquez sur le bouton &ldquo;Enregistrer les modifications&rdquo; pour chaque section (De base, Avancée et Personnaliser).

source: If you are unsure about this setting, leave it disabled.
fr_fr: Si vous n'êtes pas sûr de ce paramètre, laissez-le désactiver.

source: To restore default settings and patterns, either visit the
fr_fr: Pour restaurer les paramètres par défaut et les modèles, visitez le

source: Tools
fr_fr: Outils

source: screen or uninstall and reinstall the plugin.
fr_fr: écran ou désinstallez et réinstallez le plugin.

source: Whitelist IPs
fr_fr: IP de liste blanche

source: This setting enables you to whitelist (always allow) access from a list of IP addresses.
fr_fr: Ce paramètre vous permet d'accéder à la liste blanche (toujours autorisée) à partir d'une liste d'adresses IP.

source: This is useful if your site uses a forward/reverse proxy, load balancer, etc.
fr_fr: Ceci est utile si votre site utilise un proxy direct / inverse, un équilibreur de charge, etc.

source: If you are unsure, leave this setting blank.
fr_fr: Si vous n'êtes pas sûr, laissez ce paramètre vide.

source: IPs added to this section are matched against the IP that is reported with each request.
fr_fr: Les adresses IP ajoutées à cette section correspondent à l'IP qui est signalé pour chaque demande.

source: IPs defined here should contain only numbers and dots, for example:
fr_fr: Les adresses IP définies ici ne contiennent que des nombres et des points, par exemple:

source: Note that these IPs are treated as regular expressions,
fr_fr: Notez que ces adresses IP sont traitées comme des expressions régulières,

source: such that a pattern of
fr_fr: de sorte qu'un modèle de

source: will match every IP that begins with
fr_fr: correspondra à chaque IP qui commence par

source: So exercise caution for best results.
fr_fr: Faites donc preuve de prudence pour obtenir les meilleurs résultats.

source: Default: blank (no whitelisted IPs)
fr_fr: Par défaut: vide (pas d'adresses IP en liste blanche)

source: The Patterns screen provides three sets of BBQ Patterns: Basic, Advanced, and Custom. Each set of patterns is available under its own tab. Here is an overview:
fr_fr: L'écran fournit trois ensembles de Paramètres BBQ De base, Avancée et Personnaliser. Chaque ensemble de paramètres est disponible sous son propre onglet. Voici un aperçu:

source: Basic Patterns
fr_fr: Motifs de base

source: Basically the same patterns that are used in the free version of the plugin.
fr_fr: Fondamentalement, les mêmes modèles sont utilisés dans la version gratuite du plugin.

source: They are well-tested and recommended for all sites.
fr_fr: Ils sont bien testés et recommandés pour tous les sites.

source: Advanced Patterns
fr_fr: Modèles avancés

source: Protect against a wide variety of malicious requests and exploits.
fr_fr: Protégez-vous contre une grande variété de demandes et d'exploits malveillants.

source: They primarily are derived from the
fr_fr: Ils sont principalement dérivés de

source: Custom Patterns
fr_fr: Types de Modèles personnalisée

source: Enable you to add your own custom rules to BBQ Pro.
fr_fr: Permet d'ajouter vos règles personnalisées à BBQ Pro.

source: All BBQ patterns may be enabled, disabled, or customized as follows:
fr_fr: Tous les modèles BBQ peuvent être activés, désactivés ou personnalisés comme suit:

source: Modify a pattern
fr_fr: Modifier un paramètre

source: To modify a pattern, make any desired changes and click &ldquo;Save Changes&rdquo;.
fr_fr: Pour modifier un paramètre, effectuez les modifications souhaitées et cliquez sur &ldquo;Enregistrer les modifications&rdquo;.

source: Add a pattern
fr_fr: Ajouter Motif

source: To add your own pattern, visit the &ldquo;Custom&rdquo; tab and click &ldquo;Add Pattern&rdquo;.
fr_fr: Pour ajouter votre propre paramètre, visitez l'onglet &ldquo;Personnalisé&rdquo; et cliquez sur &ldquo;Ajouter un profil&rdquo;.

source: Remove a pattern
fr_fr: Supprimer un profil

source: To remove a pattern, first enable the setting &ldquo;Remove Disabled&rdquo;.
fr_fr: Pour supprimer un profil, activez d'abord le paramètre &ldquo;Supprimer désactivé&rdquo;.

source: Then deselect any unwanted patterns and click &ldquo;Save Changes&rdquo; to remove them.
fr_fr: Ensuite, désélectionnez les motifs indésirables et cliquez sur &ldquo;Enregistrer les modifications&rdquo; pour les supprimer.

source: Tip:
fr_fr: Conseil :

source: visit the plugin settings to enable or disable each of the three types of patterns.
fr_fr: visitez les paramètres du plugin pour activer ou désactiver chacun des trois types de modèles.

source: Toggle Panels
fr_fr: Panneau de contrôle

source: To help manage your patterns, you can toggle each panel by clicking on its title.
fr_fr: Pour aider à gérer vos modèles, vous pouvez basculer chaque panneau en cliquant sur son titre.

source: For example, to toggle the &ldquo;Query String&rdquo; panel, click on the title, &ldquo;Query String&rdquo;. Likewise for each of the other panels.
fr_fr: Par exemple, pour basculer le panneau &ldquo;Query String&rdquo; cliquez sur le titre &ldquo;Query String&rdquo;. De même pour chacun des autres panneaux.

source: click the link &ldquo;Toggle all panels&rdquo; to toggle all panels.
fr_fr: cliquez sur le lien &ldquo;Toggle all panels&rdquo; pour basculer tous les panneaux.

source: Enable Patterns
fr_fr: Activer les modèles

source: Check the checkbox for any pattern to enable it. Conversely, uncheck the checkbox for any pattern to disable it. Remember to click &ldquo;Save Changes&rdquo;.
fr_fr: Cochez la case pour activer chaque paramètre. À l'inverse, décochez la case pour désactiver n'importe quel paramètre . N'oubliez pas de cliquer sur "Enregistrer les modifications".

source: when the setting &ldquo;Remove Disabled&rdquo; is enabled, all unselected/unchecked patterns will be removed.
fr_fr: lorsque le paramètre &ldquo;Supprimer désactivé&rdquo; est activé, tous les paramètre non sélectionnés / non contrôlés seront supprimés.

source: This is useful for cleaning up unwanted patterns. At any time you can visit
fr_fr: Ceci est utile pour nettoyer les modèles indésirables. À tout moment, vous pouvez visiter

source: BBQ Tools
fr_fr: Outils BBQ

source: to restore default patterns and settings.
fr_fr: pour restaurer les paramètres par défaut.

source: check the top checkbox of any panel to automatically select all checkboxes in that panel.
fr_fr: cochez la case supérieure de chaque panneau pour sélectionner automatiquement toutes les cases dans ce panneau.

source: Pattern Count
fr_fr: Nombre de case

source: BBQ Pro records the number of times each pattern is used to block a request.
fr_fr: BBQ Pro enregistre le nombre de fois que chaque motif est utilisé pour bloquer une demande.

source: This can be useful for troubleshooting, monitoring traffic, and fine-tuning your firewall.
fr_fr: Cela peut être utile pour le dépannage, la surveillance du trafic et le réglage précis de votre pare-feu.

source: To change the count value for any pattern, edit the count field and click &ldquo;Save Changes&rdquo;.
fr_fr: Pour modifier la valeur du compteur pour n'importe quel motif, modifiez le champ du compteur et cliquez sur &ldquo;Enregistrer les modifications&rdquo;.

source: click the &ldquo;Count&rdquo; table heading to toggle (show/hide) the pattern counts.
fr_fr: cliquez sur le titre de la table &ldquo;Count&rdquo; pour basculer (afficher / masquer) le nombre de motifs.

source: Test Pattern
fr_fr: Séquence de test

source: To test any defined pattern, click on its &ldquo;Test&rdquo; button.
fr_fr: Pour tester tout motif défini, cliquez sur son bouton &ldquo;Test&rdquo;.

source: Doing so will make an URI request that includes the defined pattern (opens in new tab or window).
fr_fr: Cela fera une demande URI qui inclut le modèle défini (s'ouvre dans un nouvel onglet ou une fenêtre).
