Repository: MaximeCulea/meetup-git
Catalog: content/plugins/bbq-pro/languages/bbq-pro-*.po
Languages: fr_fr

source: This increases the pattern count and enables you to see exactly what happens when the pattern is included in a request.
fr_fr: Cela augmente le nombre de motifs et vous permet de voir exactement ce qui se produit lorsque le motif est inclus dans une requête.

source: test buttons are available only for patterns defined under &ldquo;Query String&rdquo; or &ldquo;Request URI&rdquo;.
fr_fr: les boutons de test sont disponibles uniquement pour les motifs définis sous &ldquo;Chaîne de requête&rdquo; ou "Demande d'URII&rdquo;.

source: To test User Agent Patterns, check out the handy tool at
fr_fr: Pour tester les modèles d'agent utilisateur, consultez l'outil pratique au

source: Request Maker
fr_fr: Demandeur

source: you can set the status code that BBQ sends for blocked requests by visiting &ldquo;Status Code&rdquo; in the plugin settings.
fr_fr: vous pouvez définir le code d'état que BBQ envoie pour les demandes bloquées en visitant &ldquo;Code d'état&rdquo; dans les paramètres du plugin.

source: BBQ Pro&rsquo;s Basic Patterns are the same patterns that are used in the free version of the plugin.
fr_fr: Les modèles de base de BBQ Pro&rsquo;s sont les mêmes que ceux utilisés dans la version gratuite du plugin.

source: They are well-tested and recommended for all WordPress-powered sites. There are three types of Basic Patterns:
fr_fr: Ils sont bien testés et recommandés pour tous les sites alimentés par WordPress. Il existe trois types de modèles de base:

source: Query String
fr_fr: Chaîne de requête

source: Patterns defined in this section are tested against the query-string portion of each URI request.
fr_fr: Les modèles définis dans cette section sont testés en fonction de la partie de la chaîne d'interrogation de chaque demande URI.

source: For example, if the requested URI is
fr_fr: Par exemple, si l'URI demandé est

source: the query-string is
fr_fr: chaîne de requête

source: Request URI
fr_fr: URI de requête

source: Patterns defined in this section are tested against the requested URI, not including the query string.
fr_fr: Les modèles définis dans cette section sont testés par rapport à l'URI demandé, sans compter la chaîne de requête.

source: patterns defined in this section are tested against
fr_fr: les modèles définis dans cette section sont testés contre

source: User Agent
fr_fr: Agent utilisateur

source: Patterns defined in this section are tested against the reported user agent for each URI request.
fr_fr: Les modèles définis dans cette section sont testés contre l'agent utilisateur signalé pour chaque demande URI.

source: User agents are faked easily, however many bad requests continue to report well-known and malicious agents that should be blocked whenever possible.
fr_fr: Les agents utilisateurs sont facilement falsifiés, même si de nombreuses mauvaises demandes continuent à signaler des agents connus et malveillants qui devraient être bloqués dans la mesure du possible.

source: BBQ Pro&rsquo;s Advanced Patterns protect against a wide variety of malicious requests and exploits. They primarily are derived from the
fr_fr: Les modèles avancés de BBQ Pro&rsquo;s protègent contre une grande variété de demandes et d'exploits malveillants. Ils sont principalement dérivés de

source: There are three types of Advanced Patterns:
fr_fr: Il existe trois types de modèles avancés:

source: BBQ Pro&rsquo;s Custom Patterns enable you to add your own custom rules to BBQ Pro.
fr_fr: Les modèles personnalisés de BBQ Pro&rsquo;s vous permettent d'ajouter vos propres règles personnalisées à BBQ Pro.

source: In addition to the three types of patterns used for Basic and Advanced Patterns (i.e., Query String, Request URI, and User Agent), BBQ&rsquo;s Custom Patterns include:
fr_fr: En plus des trois types de modèles utilisés pour les modèles de base et avancés (i.e., Chaîne de requête, Demande d'URI et Agent utilisateur), les modèles personnalisés de BBQ&rsquo;s incluent:

source: IP Address
fr_fr: Adresse IP

source: Patterns defined in this section are matched against the IP address that is reported with each request.
fr_fr: Les modèles définis dans cette section correspondent à l'adresse IP qui est signalée à chaque demande.

source: Patterns defined here should contain only numbers and dots, for example:
fr_fr: Les modèles définis ici ne contiennent que des nombres et des points, par exemple:

source: Note that these patterns are treated as regular expressions,
fr_fr: Notez que ces modèles sont traités comme des expressions régulières,

source: Referrer
fr_fr: Référant

source: Patterns defined in this section are tested against the reported referrer.
fr_fr: Les modèles définis dans cette section sont testés en fonction du référent signalé.

source: For example, if you keep getting bad requests from the site
fr_fr: Par exemple, si vous continuez à recevoir de mauvaises demandes du site

source: you can add the URL in this section to block them.
fr_fr: vous pouvez ajouter l'URL dans cette section pour les bloquer.

source: to test User Agent Patterns and Referrer Patterns, check out
fr_fr: tour tester les Paramètres des agents utilisateurs et les Paramètres des références, vérifier

source: BBQ Tools enable the following tasks:
fr_fr: Les outils BBQ permettent les tâches suivantes:

source: Reset Settings
fr_fr: Réinitialiser Réglages

source: reset all plugin options to their default settings
fr_fr: réinitialiser toutes les options du plugin à leurs paramètres par défaut

source: Reset Patterns
fr_fr: Réinitialiser les modèles

source: reset all patterns to default values, and reset all counts to zero
fr_fr: réinitialiser tous les modèles aux valeurs par défaut et réinitialiser tous les compteurs à zéro

source: Reset Counts
fr_fr: Réinitialiser les compteurs

source: reset all pattern counts to zero
fr_fr: réinitialiser tous les compteurs de motifs à zéro

source: resetting BBQ patterns also resets their associated count values to zero.
fr_fr: la réinitialisation des modifications de BBQ réinitialise également les compteurs associées à zéro.

source: To reset BBQ settings to their default values, check the box &ldquo;Reset Plugin Settings&rdquo; and click the &ldquo;Reset&rdquo; button.
fr_fr: Pour réinitialiser les paramètres de BBQ à leurs valeurs par défaut, cochez la case &ldquo;Réinitialiser les paramètres du plugin&rdquo; et cliquez sur le bouton &ldquo;Réinitialiser&rdquo; .

source: uninstalling BBQ Pro via the Plugin screen will remove all of the plugin&rsquo;s settings, patterns, and data.
fr_fr: la désinstallation de BBQ Pro via l'écran Plugin supprime tous les paramètres, les motifs et les données du plugin&rsquo;s.

source: Resetting BBQ patterns ensures that your firewall is current with the latest set of default patterns, which includes any changes made in updated versions of the plugin.
fr_fr: La réinitialisation des modèles de BBQ garantit que votre pare-feu est actuel avec le dernier ensemble de modèles par défaut, qui inclut les modifications apportées aux versions mises à jour du plugin.

source: To reset BBQ patterns to their default values, check one or more of the following boxes:
fr_fr: Pour réinitialiser les paramètre de BBQ à leurs valeurs par défaut, cochez une ou plusieurs des cases suivantes:

source: Reset Basic Patterns
fr_fr: Réinitialiser les modèles de base

source: Reset Advanced Patterns
fr_fr: Réinitialiser les modèles avancés

source: Reset Custom Patterns
fr_fr: Réinitialiser les modèles personnalisés

source: ..then click the &ldquo;Reset&rdquo; button and call it a day.
fr_fr: .. alors cliquez sur le bouton &ldquo;Réinitialiser&rdquo; et mettez-le par jour.

source: To reset all pattern counts to their default values, check the box &ldquo;Reset Pattern Counts&rdquo; and click the &ldquo;Reset&rdquo; button.
fr_fr: Pour réinitialiser tous les comptes de motifs à leurs valeurs par défaut, cochez la case &ldquo;Réinitialiser les compteurs de motifs&rdquo; et cliquez sur le bouton &ldquo;Réinitialiser&rdquo; .

source: BBQ License
fr_fr: Licence BBQ

source: License activation enables access to plugin settings, free auto-updates, and priority support.
fr_fr: L'activation de la licence permet d'accéder aux paramètres du plugin, aux mises à jour automatiques gratuites et au support en priorité.

source: On this screen, you may enter your License Key to enable BBQ Pro and all features. Here are the steps:
fr_fr: Sur cet écran, vous pouvez entrer votre clé de licence pour activer le BBQ Pro et toutes les fonctionnalités. Voici les étapes suivantes:

source: Enter your License Key in the &ldquo;License Key&rdquo; field
fr_fr: Entrez votre clé de licence dans le champ &ldquo;clé de licence&rdquo;

source: Click the &ldquo;Save Changes&rdquo; button
fr_fr: Cliquez sur le bouton &ldquo;Enregistrer les modifications&rdquo;

source: Click the &ldquo;Activate License&rdquo; button*
fr_fr: Cliquez sur le bouton &ldquo;Activer la licence&rdquo; button*

source: the &ldquo;Activate License&rdquo; button is displayed after entering your license and saving the changes (steps 1 and 2).
fr_fr: le bouton &ldquo;Activer la licence&rdquo; s'affiche après avoir entré votre licence et sauvegardé les modifications (étapes 1 et 2).

source: to view your License Key at any time
fr_fr: pour afficher votre clé de licence à tout moment

source: log in to your account at Plugin Planet
fr_fr: connectez-vous à votre compte Plugin Planet

source: License Status
fr_fr: Statut de la licence

source: Indicates whether or not the plugin is enabled.
fr_fr: Indique si le plugin est activé.

source: License Key
fr_fr: Clé de licence

source: Specifies the License Key for the site.
fr_fr: Spécifie la clé de licence pour le site.

source: Activate License
fr_fr: Activer votre licence

source: This button appears after entering your license in the &ldquo;License Key&rdquo; field and clicking the &ldquo;Save Changes&rdquo; button.
fr_fr: Ce bouton apparaît après avoir entré votre licence dans le &ldquo;Clé de licence&rdquo; Champ et cliquez sur le &ldquo;Enregistrer les modifications&rdquo; bouton.

source: Once your license is entered, click the &ldquo;Activate License&rdquo; button to activate your license and enable the plugin.
fr_fr: Une fois votre licence saisie, cliquez sur &ldquo;Activer la licence&rdquo; Pour activer votre licence et activer le plugin.

source: Basic
fr_fr: Basique

source: Advanced
fr_fr: Avancé

source: Custom
fr_fr: Personnaliser

source: Toggle all panels
fr_fr: Basculer tous les panneaux

source: Help
fr_fr: Aide

source: tab above for complete documentation.
fr_fr: ci-dessus pour la documentation complète.

source: Save Changes
fr_fr: Enregistrer les modifications

source: Welcome to BBQ Pro!
fr_fr: Bienvenue sur BBQ Pro !

source: Enter your License Key to enable BBQ Pro &raquo;
fr_fr: Entrez votre clé de licence pour activer BBQ Pro &raquo;

source: Add Pattern
fr_fr: Ajouter Motif

source: BBQ Patterns updated successfully.
fr_fr: Les modèles BBQ ont été mis à jour avec succès.

source: No changes made.
fr_fr: Pas de changements effectué.

source: Toggle patterns (enable/disable)
fr_fr: Marqueur de position (Activer / Désactiver)

source: Pattern
fr_fr: Motif

source: Count
fr_fr: Compteurs

source: Settings
fr_fr: Paramètres

source: License
fr_fr: Licence

source: Reset Plugin Settings
fr_fr: Réinitialiser les paramètres du plugin

source: Reset Pattern Counts
fr_fr: Réinitialiser les compteurs

source: Reset
fr_fr: Effacer

source: Reset selected items?
fr_fr: Réinitialiser les éléments sélectionnés?

source: Reset successful.
fr_fr: Réinitialiser réussi.

source: Enable BBQ&rsquo;s Basic Rules
fr_fr: Activer BBQ&rsquo;s Règles de base

source: Enable BBQ&rsquo;s Advanced Rules
fr_fr: Activer BBQ&rsquo;s Règles avancées

source: Enable BBQ&rsquo;s Custom Rules
fr_fr: Activer BBQ&rsquo;s Règles personnelles

source: Disable BBQ for logged-in users
fr_fr: Désactivez BBQ pour les utilisateurs connectés

source: Limit URL requests to 255 characters
fr_fr: Limiter les requêtes d'URL à 255 caractères

source: Enable Strict Mode (see Help tab for details)
fr_fr: Activer le mode Strict (voir l'onglet Aide pour plus de détails)

source: Redirect URL (leave blank for no redirect)
fr_fr: Redirection d'URL (laisser vide pour aucune redirection)

source: Custom Message (leave blank for no message)
fr_fr: Message personnalisé (laisser vide pour aucun message)

source: Status code
fr_fr: Code d'état

source: Remove disabled patterns
fr_fr: Supprimer les chaînes désactivées

source: IPs that never should be blocked (comma separated)
fr_fr: Les adresses IP qui ne doivent jamais être bloquées (séparées par des virgules)

source: Thanks for using
fr_fr: Merci d'utiliser

source: BBQ is Disabled
fr_fr: BBQ est désactivé

source: BBQ is Enabled
fr_fr: BBQ est activé

source: There is a new version of %1$s available. %2$sView version %3$s details%4$s.
fr_fr: Une nouvelle version de %1$s est disponible. %2$sVoir la version %3$s détails %4$s.

source: There is a new version of %1$s available. %2$sView version %3$s details%4$s or %5$supdate now%6$s.
fr_fr: Il y a une nouvelle version de %1$s disponible. %2$sVoir version %3$s détails%4$s ou %5$smettre à jour maintenant%6$s.

source: You do not have permission to install plugin updates
fr_fr: Vous n’avez pas la permission d’installer les mises à jour du plugin

source: Error
fr_fr: Erreur

source: BBQ Pro License
fr_fr: Licence Pro BBQ

source: Activate your license to enable BBQ Pro and free automatic updates.
fr_fr: Activez votre licence BBQ Pro afin de profiter des mises à jours automatiques.

source: Show/hide instructions
fr_fr: Afficher/masquer les instructions

source: View the steps&nbsp;&raquo;
fr_fr: Voir les étapess&nbsp;&raquo;

source: Follow these steps to activate your license:
fr_fr: Suivez ces étapes pour activer votre licence :

source: Get your License Key
fr_fr: Votre clé de licence

source: Enter your license in the field, &ldquo;License Key&rdquo;
fr_fr: Entrez votre licence dans le champ, &ldquo;Clé de licence&rdquo;

source: Click &ldquo;Save Changes&rdquo;
fr_fr: Cliquez &ldquo;Enregistrer les modifications&rdquo;

source: Click &ldquo;Activate License&rdquo;
fr_fr: Cliquez &ldquo;Activer la licence&rdquo;

source: If you need help,
fr_fr: Si vous avez besoin d’aide,

source: check out this guide
fr_fr: consultez ce guide

source: and/or
fr_fr: et/ou

source: contact us
fr_fr: nous contacter

source: Your BBQ Pro License is active.
fr_fr: Votre licence BBQ Pro est activée.

source: Deactivate License
fr_fr: Désactiver la licence

source: Enter your License Key
fr_fr: Entrez votre clé de licence

source: Your license is inactive. To activate, click &ldquo;Activate License&rdquo;
fr_fr: Votre licence est inactive. Pour activer, cliquez sur &ldquo;Activer la licence&rdquo;

source: Visit BBQ Pro Settings &raquo;
fr_fr: Visitez les paramètres BBQ Pro &raquo;

source: Updated!
fr_fr: Mise à jour!

source: The fastest WordPress firewall plugin. Advanced protection against malicious requests.
fr_fr: Le plugin de pare-feu WordPress le plus rapide. Protection avancée contre les demandes malveillantes.
